Revit 2026 API

# FamilyManagerTypes Property

---

All family types in the family.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public FamilyTypeSet Types { get; }
```
```vb
Public ReadOnly Property Types As FamilyTypeSet
	Get
```
```cpp
public:
property FamilyTypeSet^ Types {
	FamilyTypeSet^ get ();
}
```
```fsharp
member Types : FamilyTypeSet with get
```

#### Property Value

FamilyTypeSet

#### Reference

FamilyManager Class

Autodesk.Revit.DB Namespace